# GetKeys Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..GetKeys Method
ExportLayerTable Class See Also
---
Gets all the keys stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ExportLayerKey> GetKeys()
```

Visual Basic
---
```text
Public Function GetKeys As IList(Of ExportLayerKey)
```

Visual C++
---
```text
public:
IList<ExportLayerKey^>^ GetKeys()
```

# ### Return Value
Return the key array.
# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace